# Pandas

In [3]:
import pandas as pd
import numpy as np

In [4]:
a = np.array([2,1,3])
b = np.array([4,2,6])

In [5]:
a+b

array([6, 3, 9])

* Series is a unidimensional structure
* Dataframe is a bidimensional structure

In [6]:
import pandas as pd

In [7]:
A = pd.Series(a, index = ["january","february","march"])
A

january     2
february    1
march       3
dtype: int64

In [8]:
B = pd.Series(b, index = ["january","february","march"])
B

january     4
february    2
march       6
dtype: int64

In [9]:
A + B

january     6
february    3
march       9
dtype: int64

In [10]:
a = pd.Series(np.random.randint(0,10,size=10), index = list("ABAAACBAAB"))
a

A    0
B    9
A    4
A    1
A    3
C    8
B    7
A    3
A    8
B    3
dtype: int64

In [11]:
a.groupby(a.index).mean()

A    3.166667
B    6.333333
C    8.000000
dtype: float64

In [12]:
a.index

Index(['A', 'B', 'A', 'A', 'A', 'C', 'B', 'A', 'A', 'B'], dtype='object')

In [13]:
a.head()

A    0
B    9
A    4
A    1
A    3
dtype: int64

In [14]:
a.tail()

C    8
B    7
A    3
A    8
B    3
dtype: int64

In [15]:
a.sample()

A    3
dtype: int64

In [16]:
a.describe()

count    10.000000
mean      4.600000
std       3.169297
min       0.000000
25%       3.000000
50%       3.500000
75%       7.750000
max       9.000000
dtype: float64

In [17]:
a.dtype

dtype('int64')

In [18]:
B

january     4
february    2
march       6
dtype: int64

In [19]:
B[0]

4

In [20]:
B['january']

4

In [21]:
C = pd.Series([2,1,3], index=[2,0,1]) # index describes explicit labels
C

2    2
0    1
1    3
dtype: int64

In [22]:
C[2]

2

In [23]:
B.loc['january'] # .loc to explicit label

4

In [24]:
B.iloc[0] # .iloc to implicit label

4

In [25]:
C.iloc[1]

1

In [26]:
C.loc[1]

3

In [27]:
a["A"]

A    0
A    4
A    1
A    3
A    3
A    8
dtype: int64

In [28]:
a.iloc[3]

1

In [29]:
a.loc["A"]

A    0
A    4
A    1
A    3
A    3
A    8
dtype: int64

In [30]:
b = pd.Series(np.random.randint(0,10, size=10), index = list("ABCDEFGHIJ"))
b

A    0
B    1
C    2
D    0
E    0
F    9
G    9
H    0
I    5
J    9
dtype: int64

In [31]:
b['B':'E']

B    1
C    2
D    0
E    0
dtype: int64

In [32]:
b[2:4]

C    2
D    0
dtype: int64

In [33]:
b.loc['B':'E']

B    1
C    2
D    0
E    0
dtype: int64

In [34]:
df = pd.DataFrame(np.random.randint(0,10, size=(6,4)), index=list("ABCDEF"), columns = ['jan', 'feb','mar','apr'])
df

   jan  feb  mar  apr
A    0    5    1    5
B    2    2    0    5
C    7    4    7    3
D    8    9    8    3
E    2    6    2    5
F    9    1    1    6

In [35]:
df.ndim

2

In [36]:
df.shape

(6, 4)

In [37]:
len(df) # number of rows

6

In [38]:
df.dtypes

jan    int64
feb    int64
mar    int64
apr    int64
dtype: object

In [39]:
df.head(3)

   jan  feb  mar  apr
A    0    5    1    5
B    2    2    0    5
C    7    4    7    3

In [40]:
df.describe()

            jan       feb       mar       apr
count  6.000000  6.000000  6.000000  6.000000
mean   4.666667  4.500000  3.166667  4.500000
std    3.777124  2.880972  3.430258  1.224745
min    0.000000  1.000000  0.000000  3.000000
25%    2.000000  2.500000  1.000000  3.500000
50%    4.500000  4.500000  1.500000  5.000000
75%    7.750000  5.750000  5.750000  5.000000
max    9.000000  9.000000  8.000000  6.000000

In [41]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, A to F
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   jan     6 non-null      int64
 1   feb     6 non-null      int64
 2   mar     6 non-null      int64
 3   apr     6 non-null      int64
dtypes: int64(4)
memory usage: 240.0+ bytes

In [42]:
df.index

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [43]:
df.columns

Index(['jan', 'feb', 'mar', 'apr'], dtype='object')

In [44]:
df['feb']

A    5
B    2
C    4
D    9
E    6
F    1
Name: feb, dtype: int64

In [45]:
df.feb # this is not very safe

A    5
B    2
C    4
D    9
E    6
F    1
Name: feb, dtype: int64

In [46]:
df[2:4]

   jan  feb  mar  apr
C    7    4    7    3
D    8    9    8    3

In [47]:
df['B':'E'] # extract rows

   jan  feb  mar  apr
B    2    2    0    5
C    7    4    7    3
D    8    9    8    3
E    2    6    2    5

In [48]:
df[['mar','jan']] # extrat columns

   mar  jan
A    1    0
B    0    2
C    7    7
D    8    8
E    2    2
F    1    9

In [49]:
df[[True, False, True, False, True, False]]

   jan  feb  mar  apr
A    0    5    1    5
C    7    4    7    3
E    2    6    2    5

In [50]:
df.jan

A    0
B    2
C    7
D    8
E    2
F    9
Name: jan, dtype: int64

In [51]:
df.jan > 4

A    False
B    False
C     True
D     True
E    False
F     True
Name: jan, dtype: bool

In [52]:
df[df.jan > 4]

   jan  feb  mar  apr
C    7    4    7    3
D    8    9    8    3
F    9    1    1    6

In [53]:
df[df.jan==8].jan.index

Index(['D'], dtype='object')

In [54]:
list(df[df.jan==8].index)

['D']

In [55]:
df

   jan  feb  mar  apr
A    0    5    1    5
B    2    2    0    5
C    7    4    7    3
D    8    9    8    3
E    2    6    2    5
F    9    1    1    6

In [56]:
df.iloc[1,1]

2

In [57]:
df.iloc[2:4,1:3]

   feb  mar
C    4    7
D    9    8

In [58]:
df.loc[['B','E','A'],[True, False, True, False]]

   jan  mar
B    2    0
E    2    2
A    0    1

In [59]:
df.idxmax(axis=1)

A    feb
B    apr
C    jan
D    feb
E    feb
F    jan
dtype: object